# -*- encoding: utf-8 -*-
"""
    @Project: KR_QA_Medical.py
    @File   : answer_corpus.py
    @Author : ZHul
    @E-mail : zl2870@qq.com
    @Data   : 2023/5/15  16:24
"""
# -*- coding:utf-8 -*-
gossip_corpus = {
    "greet": [
        "hi,I'm a Medical assistant,can I help you?",
        "你好呀，您需要什么样的帮助呢？请详细描述您的问题，我会尽力为您解答。",
        "我是医疗诊断助手小M，有什么可以帮助您吗",
        "hi，你好，你可以叫我小M",
        "您好，您可以问我一些关于疾病诊断的问题"
    ],
    "goodbye": [
        "再见，很高兴为您服务。",
        "如果您还需要帮助，请随时联系我们，我们随时为您服务。",
        "再见，感谢使用我的服务。",
        "谢谢您的咨询，祝您身体健康。"
    ],
    "deny": [
        "很抱歉没帮到您,如果您对我的回答有任何疑问或建议，也可以随时告诉我，我会尽力改进和提供更好的服务。",
        "I am sorry,you can try again.",
        "非常抱歉，您的问题不够清晰明确，我无法给出具体的回答。",
        "您可以试着问我其他问题。",
        "请提供更具体的信息，以便我能够更好地帮助您。"
    ],
    "isbot": [
        "我是一个基于人工智能技术的语言模型，如果您需要医疗相关的帮助，请详细描述您的问题，我会尽力为您解答。",
        "我是医疗诊断助手Medical assistant,您可以叫我小M,有什么能够帮到您的。"
    ],
    "accept": [
        "好的，如果您有任何其他问题，请随时问我。",
        "好的，请问您还有什么问题需要我回答呢？我会尽力为您提供详细的解释。",
        "希望我的回答对您有帮助，如果您有任何其他问题，请随时问我。"
    ],
    "diagnosis": [
        "您说的我有点不明白，您可以换个问法问我。",
        "很抱歉我还不知道怎么回答这个问题,您可以问我一些有关疾病的定义、原因、治疗方法、注意事项、挂什么科室、预防、禁忌等相关问题"
        "当您提出具体问题时，我会尽力提供详细的回答。请您提供尽可能多的信息，例如症状、病因、治疗方法、预防、禁忌等等,这样我才能更好地理解您的问题并给出准确的答案。"
    ],
    "dont_know": [
        "非常抱歉，我还不知道如何回答您，我正在努力学习中。",
        "很抱歉，我无法理解这个问题。如果您需要其他方面的帮助，请详细描述您的问题，我会尽力为您解答。"
    ]
}
